In [81]:
import pandas as pd
import numpy as np

In [82]:
forum_users = {
    'UserID': np.array([1, 2, 3, 4, 5]),
    'Username': ['jane_smith', 'alex123', 'bob56', 'mark_wilson', 'test_name'],
    'Age': [18, 35, 25, 28, None],
    'Joined Date': pd.to_datetime(['2034-01-01', '2034-02-15', '2034-04-25', '2034-06-21', '2034-09-15']),
    'Total Posts': [150, 230, 80, 420, 310],
    'Reputation': [500, 720, 200, 940, 500]
}

df = pd.DataFrame(forum_users)
df

   UserID     Username   Age Joined Date  Total Posts  Reputation
0       1   jane_smith  18.0  2034-01-01          150         500
1       2      alex123  35.0  2034-02-15          230         720
2       3        bob56  25.0  2034-04-25           80         200
3       4  mark_wilson  28.0  2034-06-21          420         940
4       5    test_name   NaN  2034-09-15          310         500

In [83]:
type(df)

pandas.core.frame.DataFrame

In [84]:
df.columns

Index(['UserID', 'Username', 'Age', 'Joined Date', 'Total Posts',
       'Reputation'],
      dtype='object')

In [85]:
df.columns.tolist()

['UserID', 'Username', 'Age', 'Joined Date', 'Total Posts', 'Reputation']

In [86]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [87]:
df.index.tolist()

[0, 1, 2, 3, 4]

In [88]:
df.dtypes

UserID                  int64
Username               object
Age                   float64
Joined Date    datetime64[ns]
Total Posts             int64
Reputation              int64
dtype: object

In [89]:
df.values

array([[1, 'jane_smith', 18.0, Timestamp('2034-01-01 00:00:00'), 150,
        500],
       [2, 'alex123', 35.0, Timestamp('2034-02-15 00:00:00'), 230, 720],
       [3, 'bob56', 25.0, Timestamp('2034-04-25 00:00:00'), 80, 200],
       [4, 'mark_wilson', 28.0, Timestamp('2034-06-21 00:00:00'), 420,
        940],
       [5, 'test_name', nan, Timestamp('2034-09-15 00:00:00'), 310, 500]],
      dtype=object)

In [90]:
type(df.values)

numpy.ndarray

In [91]:
df.head(3)

   UserID    Username   Age Joined Date  Total Posts  Reputation
0       1  jane_smith  18.0  2034-01-01          150         500
1       2     alex123  35.0  2034-02-15          230         720
2       3       bob56  25.0  2034-04-25           80         200

In [92]:
df.values[1, 1]

'alex123'

In [93]:
df.tail(2)

   UserID     Username   Age Joined Date  Total Posts  Reputation
3       4  mark_wilson  28.0  2034-06-21          420         940
4       5    test_name   NaN  2034-09-15          310         500

In [94]:
df.describe().round(2)

       UserID    Age          Joined Date  Total Posts  Reputation
count    5.00   4.00                    5          5.0        5.00
mean     3.00  26.50  2034-04-28 09:36:00        238.0      572.00
min      1.00  18.00  2034-01-01 00:00:00         80.0      200.00
25%      2.00  23.25  2034-02-15 00:00:00        150.0      500.00
50%      3.00  26.50  2034-04-25 00:00:00        230.0      500.00
75%      4.00  29.75  2034-06-21 00:00:00        310.0      720.00
max      5.00  35.00  2034-09-15 00:00:00        420.0      940.00
std      1.58   7.05                  NaN        133.3      276.62

In [95]:
df.select_dtypes(include='object')

      Username
0   jane_smith
1      alex123
2        bob56
3  mark_wilson
4    test_name

In [96]:
df.select_dtypes(include='object').columns

Index(['Username'], dtype='object')

In [97]:
df.select_dtypes(include='int64')

   UserID  Total Posts  Reputation
0       1          150         500
1       2          230         720
2       3           80         200
3       4          420         940
4       5          310         500

In [98]:
df.isna()

   UserID  Username    Age  Joined Date  Total Posts  Reputation
0   False     False  False        False        False       False
1   False     False  False        False        False       False
2   False     False  False        False        False       False
3   False     False  False        False        False       False
4   False     False   True        False        False       False

In [99]:
df.isna().sum()

UserID         0
Username       0
Age            1
Joined Date    0
Total Posts    0
Reputation     0
dtype: int64